# GetBoundingBox Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..GetBoundingBox Method
ElementRecord Class See Also
---
Gets the bounding box of the element record.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Outline GetBoundingBox()
```

Visual Basic
---
```text
Public Function GetBoundingBox As Outline
```

Visual C++
---
```text
public:
Outline^ GetBoundingBox()
```

# ### Return Value
The bounding box outline. nullNothingnullptra null reference (Nothing in Visual Basic) if there is no bounding box for this element.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace